app/controllers/songs_controller.rb

  def upload
    CSV.foreach(params[:file].path,headers:true) do |song|
      Song.create(title:song[0],artist:Artist.find_or_create_by(name:song[1]))
---
INSERT INTO "artists" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", ".38 Special"], ["created_at", "2019-05-19 14:11:02.454990"], ["updated_at", "2019-05-19 14:11:02.454990"]]
INSERT INTO "songs" ("title", "created_at", "updated_at", "artist_id") VALUES (?, ?, ?, ?)  [["title", "Caught Up in You"], ["created_at", "2019-05-19 14:11:02.457247"], ["updated_at", "2019-05-19 14:11:02.457247"], ["artist_id", 138]]
SELECT  "artists".* FROM "artists" WHERE "artists"."name" = ? LIMIT ?  [["name", ".38 Special"], ["LIMIT", 1]]